Revit 2026 API

# HVACLoadTypePowerLoadDensity Property

---

The power load density.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double PowerLoadDensity { get; set; }
```
```vb
Public Property PowerLoadDensity As Double
	Get
	Set
```
```cpp
public:
property double PowerLoadDensity {
	double get ();
	void set (double value);
}
```
```fsharp
member PowerLoadDensity : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The value should be between [0.0,500000.0]. |

#### Reference

HVACLoadType Class

Autodesk.Revit.DB.Analysis Namespace